In [4]:
### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

SyntaxError: invalid syntax (<ipython-input-4-9ae1167246c5>, line 2)

In [75]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file_to_load)

In [132]:
df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total,Total Reviews
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,131.53,135.06
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,185.56,187.12
2,2,Ithergue48,24,Male,92,Final Critic,4.88,122.88,127.76
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,130.27,133.54
4,4,Iskosia90,23,Male,131,Fury,1.44,159.44,160.88
...,...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,859.54,863.08
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,962.63,964.26
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,867.46,870.92
778,778,Sisur91,7,Male,101,Final Critic,4.19,890.19,894.38
779,779,Ennrian78,24,Male,50,Dawn,4.60,857.60,862.20

In [133]:
purchases = df["Item ID"].count()
purchases

780

In [134]:
total = df["Price"].sum()
total

2379.77

In [135]:
average = df["Price"].mean()
average

3.050987179487176

In [136]:
sn_count = len(df["Item ID"].unique())
sn_count

183

In [137]:
players = len(df["SN"].unique())
players

576

In [138]:
players2 = df["Gender"].value_counts()
players2

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [139]:
summary_table = pd.DataFrame({"Total Number of Players": [players]})
summary_table

   Total Number of Players
0                      576

In [140]:
df["Total"] = df.sum(axis=1)

df["Total"]

0       398.12
1       558.24
2       373.52
3       394.08
4       479.76
        ...
775    2582.16
776    2889.52
777    2605.84
778    2674.76
779    2577.40
Name: Total, Length: 780, dtype: float64

In [141]:
player_detail = df.pivot_table(index=['SN'], aggfunc='size')
print (player_detail)

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Length: 576, dtype: int64

In [143]:
#calculations
df['Total Reviews'] = df.iloc[:, 6:].sum(axis=1)
total_reviews = sum(df['Total Reviews'])
total_reviews

1590162.389999999

## Purchasing Analysis (Total)

In [210]:
* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

SyntaxError: invalid syntax (<ipython-input-210-af379fa3895b>, line 1)

In [211]:
summary_table = pd.DataFrame({"Total Revenue": [total], "Average Price": average, "Number of Purchases": purchases, "Number of Unique Items": sn_count})
summary_table

   Total Revenue  Average Price  Number of Purchases  Number of Unique Items
0        2379.77       3.050987                  780                     183

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     183         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [212]:
totalcount = df['Gender'].value_counts()
totalcount

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [213]:
gender_stats = df.groupby("Gender")

# Count the total of screen names "SN" by gender
total_count_gender = gender_stats.nunique()["SN"]

# Total count by gender and divivde by total players 
percentage_of_players = total_count_gender / players * 100

# Create data frame with obtained values
gender_demographics = pd.DataFrame({"Percentage of Players": percentage_of_players, "Total Count": total_count_gender})

# Format the data frame with no index name in the corner
gender_demographics.index.name = None

# Format the values sorted by total count in descending order, and two decimal places for the percentage
gender_demographics.sort_values(["Total Count"], ascending = False).style.format({"Percentage of Players":"{:.2f}"})

In [214]:
gender_stats = df.groupby("Gender")

# Count the total of screen names "SN" by gender
total_count_gender = gender_stats.nunique()["SN"]
total_count_gender

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [215]:
percentofplayers = total_count_gender/576
play = percentofplayers.map("{0:.2%}".format)
play

Gender
Female                   14.06%
Male                     84.03%
Other / Non-Disclosed     1.91%
Name: SN, dtype: object

In [216]:
percentofplayers = df['Gender'].value_counts()/780
play = percentofplayers.map("{0:.2%}".format)

In [217]:
player_summary_table = pd.DataFrame({"Total Count": total_count_gender, "Percentage of Player": play})
player_summary_table

                       Total Count Percentage of Player
Female                          81               14.49%
Male                           484               83.59%
Other / Non-Disclosed           11                1.92%

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [218]:
grouped_data_df = df.groupby('Gender').Price.sum()
gendertotal = grouped_data_df
gendertotal


# The object returned is a "GroupBy" object and cannot be viewed normally...
#print(grouped_data_df)

# In order to be visualized, a data function must be used...
#grouped_data_df.count()

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [219]:
#purchase_value = grouped_data_df["Price"].sum()
#purchase_value

In [220]:
avgtotprice = grouped_data_df/total_count_gender
avgtotprice

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [221]:
avgpurprice = gendertotal/totalcount
avgpurprice

Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
dtype: float64

In [222]:
#atppp = grouped_data_df["Total"].mean()
#atppp

In [223]:
player_summary_table2 = pd.DataFrame({"Purchase Count": totalcount, "Average Purchase Price": avgpurprice, "Total Purchase Value": gendertotal, "Avg Total Purchase per Person": avgtotprice})
player_summary_table2

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [224]:
print(df["Age"].max())

45

In [255]:
bins = [0, 10, 14, 19, 24, 29, 34, 39, 40]

# Create labels for these bins
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [257]:
df["Age Group"] = pd.cut(df["Age"], bins, labels=group_labels)
df
#purchase_data["Age Group"] = pd.cut(purchase_data["Age"],age_bins, labels=group_names)
#purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total,Total Reviews,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,398.12,536.71,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,558.24,746.92,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,373.52,506.16,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,394.08,530.89,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,479.76,642.08,20-24
...,...,...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,2582.16,3448.78,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,2889.52,3855.41,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,2605.84,3480.22,20-24
778,778,Sisur91,7,Male,101,Final Critic,4.19,2674.76,3573.33,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,2577.40,3444.20,20-24

In [285]:
bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

df["Age Group"] = pd.cut(df["Age"],bins, labels=group_labels)
df

new_age = df.groupby("Age Group")

unique_sn = new_age["SN"].nunique()

percentage2 = (total_count_age/players)

age_demographics = pd.DataFrame({"Percentage of Players": percentage2, "Total Count": unique_sn})


age_demographics.style.format({"Percentage of Players":"{:,.2%}"})

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

In [297]:
purchase2 = new_age["Purchase ID"].count()
avgpurprice2 = new_age["Price"].mean()
totpurchase2 = new_age["Price"].sum()

In [299]:
avgspendingperson2 = totpurchase2/unique_sn

In [300]:
purchase_age_analysis = pd.DataFrame({"Purchase Count": purchase2,
                                 "Average Purchase Price": avgpurprice2,
                                 "Total Purchase Value":totpurchase2,
                                 "Average Purchase Total per Person": avgspendingperson2})

purchase_age_analysis.style.format({"Average Purchase Price":"${:,.2f}",
                               "Total Purchase Value":"${:,.2f}",
                               "Average Purchase Total per Person":"${:,.2f}"})

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [309]:
spending = df.groupby("SN")

In [310]:
purchaseid = spending["Purchase ID"].count()
avg_price = spending["Price"].mean()
purchase_total = spending["Price"].sum()

In [311]:
top_spenders = pd.DataFrame({"Purchase Count": purchaseid,
                             "Average Purchase Price": avg_price,
                             "Total Purchase Value":purchase_total})
formatted_spenders.style.format({"Average Purchase Total":"${:,.2f}",
                                 "Average Purchase Price":"${:,.2f}", 
                                 "Total Purchase Value":"${:,.2f}"})

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [338]:
items = df[["Item ID", "Item Name", "Price"]]
most_popular = items.groupby(["Item ID","Item Name"])
purchase_count_item = most_popular["Price"].count()
purchase_value = (most_popular["Price"].sum()) 
item_price = purchase_value/purchase_count_item
popular_items = pd.DataFrame({"Purchase Count": purchase_count_item, "Item Price": item_price,"Total Purchase Value":purchase_value})
popular_formatted = popular_items.sort_values(["Purchase Count"], ascending=False).head()                                  
popular_formatted.style.format({"Item Price":"${:,.2f}","Total Purchase Value":"${:,.2f}"})

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

In [332]:

popular_formatted = most_popular_items.sort_values(["Total Purchase Value"],ascending=False).head()
popular_formatted.style.format({"Item Price":"${:,.2f}","Total Purchase Value":"${:,.2f}"})

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80